Revit 2027 API
EnergyAnalysisOpening.CADObjectUniqueId Property
 The unique id of the originating CAD object (model element) associated with this opening.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CADObjectUniqueId { get; }
Public ReadOnly Property CADObjectUniqueId As String
	Get
public:
property String^ CADObjectUniqueId {
	String^ get ();
}
member CADObjectUniqueId : string with get
Property Value
String
Remarks
 This unique id can be passed to the Document.GetElement(string) method. If the originating element belongs to a linked document, the unique id of the link obtained from CADLinkUniqueId should be used to access it. CADObjectUniqueId is unrelated to the CADObjectId element in gbxml.
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace